tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
    char filename[64];
    fsDownloadFilename(path, filename, sizeof(filename));
    sendResponseHeader("Cache-Control", "no-store");
    if (!beginResponse(200, "application/octet-stream", filename)) {
        g_server.send(500, "text/plain", "Download failed");
        return;
    }

    size_t sent = 0;
    if (firstLen > 0) {
        sendChunk(reinterpret_cast<const char*>(buffer), firstLen);
        sent = firstLen;
    }
    while (sent < size && !g_responseBroken) {
        const size_t maxLen = size - sent > sizeof(buffer) ? sizeof(buffer) : size - sent;
        size_t readLen = 0;
        if (!Esp32BaseFs::readBytesAt(path, static_cast<uint32_t>(sent), buffer, maxLen, &readLen) || readLen == 0) {
            ESP32BASE_LOG_W("web", "fs_download_read_failed path=%s offset=%lu", path, static_cast<unsigned long>(sent));
            break;
        }
        sendChunk(reinterpret_cast<const char*>(buffer), readLen);
        sent += readLen;
        fsScanYield();
    }
    endResponse();
    ESP32BASE_LOG_I("web", "fs_download_requested path=%s bytes=%lu", path, static_cast<unsigned long>(sent));
}

void handleFsCheckGet() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        fsSendUploadJson(503, false, "File system unavailable", nullptr);
        return;
    }
    char dir[96];
    char name[64];
    char path[96];
    if (!fsReadArg("dir", dir, sizeof(dir)) || !fsReadArg("name", name, sizeof(name))) {
        fsSendUploadJson(400, false, "Invalid filename or target path", nullptr);
        return;
    }
    if (!fsUploadDirectoryExists(dir)) {
        fsSendUploadJson(400, false, "Target directory missing", nullptr);
        return;
    }
    if (!fsBuildUploadPath(dir, name, path, sizeof(path))) {
        fsSendUploadJson(400, false, "Invalid filename or target path", nullptr);
        return;
    }
    if (fsUploadTargetIsDirectory(path)) {
        fsSendUploadJson(400, false, "Target is a directory", path, false, true);
        return;
    }
    const bool exists = Esp32BaseFs::fileSize(path) >= 0;
    fsSendUploadJson(200, true, nullptr, path, exists, false);
}

void handleFsUploadDone() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (g_fsUploadForbidden || !requestSameOrigin()) {
        ESP32BASE_LOG_W("web", "post_rejected context=fs_upload reason=cross_origin");
        g_fsUploadForbidden = false;
        g_fsUploadStartFailed = false;
        fsCloseUploadFile();
        fsSendUploadJson(403, false, "forbidden", g_fsUploadPath);
        return;
    }
    g_fsUploadForbidden = false;
    const bool startFailed = g_fsUploadStartFailed;
    g_fsUploadStartFailed = false;
    fsCloseUploadFile();
#if ESP32BASE_ENABLE_APP_EVENTS
    const bool targetIsAppEvents = g_fsUploadPath[0] && appEventsOwnsPath(g_fsUploadPath);
    if (targetIsAppEvents) {
        Esp32BaseAppEventLog::reload();
    }
#endif
#if ESP32BASE_ENABLE_FILELOG
    if (g_fsUploadPath[0] && (fileLogOwnsPath(g_fsUploadPath) || Esp32BaseFileLog::faulted())) {
        Esp32BaseFileLog::begin();
    }
#endif
    if (startFailed || g_fsUploadError[0]) {
        ESP32BASE_LOG_W("web", "fs_upload_rejected path=%s error=%s", g_fsUploadPath[0] ? g_fsUploadPath : "-", g_fsUploadError[0] ? g_fsUploadError : "upload rejected");
        fsSendUploadJson(400, false, g_fsUploadError[0] ? g_fsUploadError : "upload rejected", g_fsUploadPath);
        return;
    }
    const int64_t actualSize = g_fsUploadPath[0] ? Esp32BaseFs::fileSize(g_fsUploadPath) : -1;
    if (actualSize >= 0 &&
        static_cast<uint64_t>(actualSize) == g_fsUploadBytes &&
        fsUploadFileReadableEnd(g_fsUploadPath, static_cast<uint64_t>(actualSize))) {
        ESP32BASE_LOG_W("web", "fs_upload_completed path=%s bytes=%lu overwrite=%s",
                        g_fsUploadPath,
                        static_cast<unsigned long>(g_fsUploadBytes),
                        g_fsUploadOverwrite ? "yes" : "no");
        if (beginResponse(200, "application/json", nullptr)) {
            sendChunk("{\"ok\":true,\"redirect\":\"/esp32base/fs?manage=1&uploaded=1\",\"path\":\"");
            sendEscapedJsonChunk(g_fsUploadPath);
            sendChunk("\"}");
            endResponse();
        }
        return;
    }
    fsSendUploadJson(500, false, "Upload verification failed", g_fsUploadPath);
}

void handleFsUpload() {
    if (!isAuthenticated()) {
        if (g_server.upload().status == UPLOAD_FILE_START) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("unauthorized");
        }
        return;
    }
    HTTPUpload& upload = g_server.upload();
    if (upload.status == UPLOAD_FILE_START) {
        g_fsUploadForbidden = false;
        g_fsUploadStartFailed = false;
        g_fsUploadActive = false;
        g_fsUploadOverwrite = g_server.hasArg("overwrite") && g_server.arg("overwrite") == "1";
        g_fsUploadBytes = 0;
        g_fsUploadPath[0] = '\0';
        g_fsUploadError[0] = '\0';
        if (!requestSameOrigin()) {
            g_fsUploadForbidden = true;
            g_fsUploadStartFailed = true;
            fsSetUploadError("forbidden");
            ESP32BASE_LOG_W("web", "post_rejected context=fs_upload reason=cross_origin");
            return;
        }
        if (!Esp32BaseFs::isReady()) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File system unavailable");
            return;
        }
        char dir[96];
        if (!fsReadArg("dir", dir, sizeof(dir))) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Invalid filename or target path");
            return;
        }
        if (!fsUploadDirectoryExists(dir)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Target directory missing");
            return;
        }
        if (!fsBuildUploadPath(dir, upload.filename.c_str(), g_fsUploadPath, sizeof(g_fsUploadPath))) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Invalid filename or target path");
            return;
        }
        if (fsUploadTargetIsDirectory(g_fsUploadPath)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Target is a directory");
            return;
        }
#if ESP32BASE_ENABLE_FILELOG
        if (fileLogOwnsPath(g_fsUploadPath) && Esp32BaseFileLog::isEnabled()) {
            Esp32BaseFileLog::flush();
        }
#endif
        const bool exists = Esp32BaseFs::fileSize(g_fsUploadPath) >= 0;
        if (exists && !g_fsUploadOverwrite) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File exists");
            return;
        }
        if (!Esp32BaseFs::writeBytes(g_fsUploadPath, nullptr, 0)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Could not open target file");
            return;
        }
        g_fsUploadActive = true;
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (g_fsUploadForbidden || g_fsUploadStartFailed || !g_fsUploadActive) {
            return;
        }
        if (!Esp32BaseFs::appendBytes(g_fsUploadPath, upload.buf, upload.currentSize)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File write failed");
            fsCloseUploadFile();
            return;
        }
        g_fsUploadBytes += upload.currentSize;
        fsScanYield();
    } else if (upload.status == UPLOAD_FILE_END) {
        if (g_fsUploadForbidden || g_fsUploadStartFailed || !g_fsUploadActive) {
            return;
        }
        fsCloseUploadFile();
        if (upload.totalSize > 0 && g_fsUploadBytes != upload.totalSize) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Upload size mismatch");
            return;
        }
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        g_fsUploadStartFailed = true;
        fsSetUploadError("Upload aborted");
        fsCloseUploadFile();
    }
}

void handleFsDeletePost() {
    markRequest();
    if (!ensurePostAllowed("fs_delete")) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        redirectSeeOther("/esp32base/fs?manage=1&error=fs_unavailable");
        return;
    }
    char path[96];
    if (!fsReadPathArg("path", path, sizeof(path))) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected reason=invalid_path");
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_invalid");
        return;
    }
    if (Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr)) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=directory", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_directory");
        return;
    }
    if (Esp32BaseFs::fileSize(path) < 0) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=missing", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_missing");
        return;
    }
#if ESP32BASE_ENABLE_APP_EVENTS
    const bool targetIsAppEvents = appEventsOwnsPath(path);
#endif
#if ESP32BASE_ENABLE_FILELOG
    const bool targetIsFileLog = fileLogOwnsPath(path);
    const bool retryFileLogAfterDelete = Esp32BaseFileLog::faulted();
    if (targetIsFileLog && Esp32BaseFileLog::isEnabled()) {
        ESP32BASE_LOG_W("web", "fs_delete_requested path=%s target=filelog", path);
        Esp32BaseFileLog::flush();
    }
#endif
    bool ok = Esp32BaseFs::removeFile(path);
#if ESP32BASE_ENABLE_FILELOG
    if (!targetIsFileLog) {
        ESP32BASE_LOG_W("web", "fs_delete_requested path=%s result=%s", path, ok ? "success" : "failed");
    }
    if (ok && (targetIsFileLog || retryFileLogAfterDelete)) {
        Esp32BaseFileLog::begin();
    }
#else
    ESP32BASE_LOG_W("web", "fs_delete_requested path=%s result=%s", path, ok ? "success" : "failed");
#endif
#if ESP32BASE_ENABLE_APP_EVENTS
    if (ok && targetIsAppEvents) {
        const bool reloadOk = Esp32BaseFs::fileSize(path) == 0
            ? Esp32BaseAppEventLog::clear()
            : Esp32BaseAppEventLog::reload();
        if (!reloadOk) {
            ok = false;
        }
    }
#endif
    redirectSeeOther(ok ? "/esp32base/fs?manage=1&deleted=1" : "/esp32base/fs?manage=1&error=delete_failed");
}
#endif

} // namespace esp32base_web

#endif
